package CourseWork.dao.implementation;

import CourseWork.models.AdminObject;
import CourseWork.models.NewsObject;

public class Test {
    public static void generate(Database database) {

        // Adding the admins
        AdminObject admin1 = new AdminObject(1, "admin1", "admin", "admin");

        database.admins.put(admin1.getAdminId(), admin1);

        // Adding the news
        NewsObject news1 = new NewsObject(1,
                "Європа повертається до життя",
                "У понеділок Єврокомісія винесла на розгляд питання про відкриття зовнішніх кордонів ЄС. " +
                        "Пропонується дозволити в'їзд туристам, які пройшли повну вакцинацію одним з преператов, " +
                        "схвалених на території блоку. Буде також братися до уваги ковід статистика в країні вильоту.\n" +
                        "З понеділка у Франції школярі різного віку повернулися за парти. " +
                        "Влада приступили до поетапного виходу з третього загальнонаціонального локдауна. " +
                        "Жителям країни тепер можна їхати від місць проживання на 10 і більше кілометрів. " +
                        "Пізніше в травні уряд планує скоротити тривалість комендантської години, " +
                        "він буде починатися о 9 годині вечора замість 7.",
                1, "04.05.2021");

        NewsObject news2 = new NewsObject(2,
                "Кличко збирається збудувати ще одну велодоріжку у Києві",
                "Сьогодні мер Києва Володимир Кличко офіційно заявив у себе в твіттері, " +
                        "що він серйозно переживає за можливість добиратися до роботи своїх громадян. " +
                        "«Ніхто не знає, коли в наступний раз знову прийдеться вводити обмеження на громадський транспорт», - пише мер Києва.",
                2, "04.05.2021");

        NewsObject news3 = new NewsObject(3,
                "У Києві відкрилася виставка сучасного білоруського мистецтва",
                "У Мистецькому арсеналі в Києві відкрилася виставка сучасного білоруського мистецтва " +
                        "\"Кожны дзень. Мистецтво. Солідарність. Спротив\". Вона працюватиме до 6 червня.\n" +
                        "Про це повідомляє кореспондент Укрінформу.\n" +
                        "Як зазначають у Мистецькому арсеналі, виставка \"Кожны дзень\" є зрізом " +
                        "сучасного білоруського мистецтва, яке досліджує та розповідає історії солідарності, " +
                        "самоорганізації, спротиву та мрій про краще майбутнє.",
                3, "03.05.2021");

        NewsObject news4 = new NewsObject(4,
                "В Україні жорсткі диски подорожчали в два рази через майнінг Chia Coin",
                "Відповідно до джерел, гряде нова хвиля майнінгу. " +
                        "Ніхто не стверджує, що класичні Bitcoin і Ethereum відійдуть на другий план, " +
                        "але скоро на одній лінії з ними постане нова криптовалюта Chia Coin. " +
                        "Прямо з Китаю, як і відомий всім вірус, вона стане новим етапом розвитку " +
                        "децентралізованих систем для людства. Тільки в хорошому сенсі. " +
                        "Їй пророкують величезні цінові досягнення вже в цьому році.",
                4, "01.05.2021");

        NewsObject news5= new NewsObject(5,
                "Шевченко довикликав у збірну України Євгена Коноплянку",
                "Головний тренер національної збірної України Андрій Шевченко вирішив додати до" +
                        " розширеного списку футболістів, що готуватимуться до фінального турніру Євро-2020, " +
                        "досвідченого гравця національної команди Євгена Коноплянку.\n" +
                        "Нині півзахисник, на рахунку якого 86 ігор та 21 гол за \"синьо-жовтих\", " +
                        "проходить процес реабілітації після надриву задньої поверхні стегна, " +
                        "що трапився під час березневого збору національної команди.\n" +
                        "Якщо Євген відновиться і буде готовий узятися до роботи, він приєднається " +
                        "до табору головної команди, яка в період з 15 травня до 8 червня готуватиметься до Євро в Харкові.",
                5, "31.05.2020");

        database.newses.put(news1.getId(), news1);
        database.newses.put(news2.getId(), news2);
        database.newses.put(news3.getId(), news3);
        database.newses.put(news4.getId(), news4);
        database.newses.put(news5.getId(), news5);

    }
}
